# MacroFailures Properties

---
The BuiltInFailuresMacroFailures type exposes the following members.
| Name| Description
---|---|---
| DuplicateModuleName|  Macro project with name [MacroModuleName] duplicates with central file. Delete the macro project or re-create it with another name to proceed.
Top
#### Reference
BuiltInFailuresMacroFailures Class
Autodesk.Revit.DB Namespace